---
kind: type
id: T:Autodesk.Revit.DB.StructuralAsset
source: html/39c2e2ad-474e-2514-bc15-07c24a989a61.htm
---
# Autodesk.Revit.DB.StructuralAsset

Represents the properties of a material pertinent to structural analysis.

## Syntax (C#)
```csharp
public class StructuralAsset : IDisposable
```